Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
/** BLK_CTRL_WAKEUPMIX - Size of Registers Arrays */
#define BLK_CTRL_WAKEUPMIX_NETC_LINK_COUNT        5u
#define BLK_CTRL_WAKEUPMIX_NETC_REVMII_COUNT      5u

/** BLK_CTRL_WAKEUPMIX - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t IPG_DEBUG1;                        /**< IPG DEBUG mask bit, offset: 0x4 */
  __IO uint32_t IPG_DEBUG2;                        /**< IPG DEBUG mask bit, offset: 0x8 */
  __IO uint32_t IPG_DEBUG3;                        /**< IPG DEBUG mask bit, offset: 0xC */
       uint8_t RESERVED_1[4];
  __IO uint32_t SSI;                               /**< SSI master low power mode control, offset: 0x14 */
  __IO uint32_t ECAT_MISC_CFG;                     /**< EtherCAT miscellaneous configuration, offset: 0x18 */
  __IO uint32_t DEXSC_ERR;                         /**< DEXSC error response configuration, offset: 0x1C */
  __IO uint32_t USBPHY_MISC_CTRL;                  /**< USBPHY miscellaneous control, offset: 0x20 */
  __IO uint32_t NETC_PORT_MISC_CFG;                /**< NETC Port miscellaneous configuration, offset: 0x24 */
  __IO uint32_t M7_NMI_CLR;                        /**< M7 NMI interrupt clear register, offset: 0x28 */
       uint8_t RESERVED_2[4];
  __IO uint32_t QTIMER_CTRL1;                      /**< Qtimer miscellaneous control register 1, offset: 0x30 */
  __IO uint32_t QTIMER_CTRL2;                      /**< Qtimer miscellaneous control register 2, offset: 0x34 */
  __IO uint32_t SAI2_MCLK_CTRL;                    /**< SAI2 MCLK control register, offset: 0x38 */
  __IO uint32_t SAI3_MCLK_CTRL;                    /**< SAI3 MCLK control register, offset: 0x3C */
  __IO uint32_t SAI4_MCLK_CTRL;                    /**< SAI4 MCLK control register, offset: 0x40 */
  __IO uint32_t XBAR_DIR_CTRL1;                    /**< XBAR IO direction control register, offset: 0x44 */
  __IO uint32_t XBAR_DIR_CTRL2;                    /**< XBAR IO direction control register, offset: 0x48 */
  __IO uint32_t LPIT_TRIG_SEL;                     /**< LPIT trigger input select register, offset: 0x4C */
  __IO uint32_t AXI_ATTR_CFG;                      /**< AXI bus attribute configuration register, offset: 0x50 */
  __IO uint32_t SRAMCR0;                           /**< SRAM Control Register 0, offset: 0x54 */
  __IO uint32_t SRAMCR1;                           /**< SRAM Control Register 1, offset: 0x58 */
       uint8_t RESERVED_3[4];
  __IO uint32_t SLAVE_STOP_MODE_CFG;               /**< Slave stop mode configure register, offset: 0x60 */
       uint8_t RESERVED_4[16];
  __IO uint32_t I3C2_ASYNC_WAKEUP_CTRL;            /**< I3C2 async wakeup control register, offset: 0x74 */
  __IO uint32_t XBAR_AOI_WE;                       /**< XBAR and AOI write protect register, offset: 0x78 */
  __IO uint32_t XBAR_TRIG_SYNC_CTRL1;              /**< XBAR trigger synchronizer control register1, offset: 0x7C */
  __IO uint32_t XBAR_TRIG_SYNC_CTRL2;              /**< XBAR trigger synchronizer control register2, offset: 0x80 */
       uint8_t RESERVED_5[124];
  __IO uint32_t NETC_LINK_CFG[BLK_CTRL_WAKEUPMIX_NETC_LINK_COUNT]; /**< NETC link configuration for port0..NETC link configuration for port4, array offset: 0x100, array step: 0x4 */
  __IO uint32_t NETC_REVMII_DLL[BLK_CTRL_WAKEUPMIX_NETC_REVMII_COUNT]; /**< NETC RevMII RGMII delay line configuration for port0..NETC RevMII RGMII delay line configuration for port4, array offset: 0x114, array step: 0x4 */
       uint8_t RESERVED_6[8];
  __IO uint32_t SAFETY_CLK_MON_CS;                 /**< Safety clock monitor control and status register, offset: 0x130 */
  __IO uint32_t SAFETY_CLK_MON_TH;                 /**< Safety clock monitor threshold register, offset: 0x134 */
       uint8_t RESERVED_7[8];
  __IO uint32_t EMC_B1_IO_CTRL;                    /**< GPIO_EMC_B1 bank IO control, offset: 0x140 */
  __IO uint32_t EMC_B2_IO_CTRL;                    /**< GPIO_EMC_B2 bank IO control, offset: 0x144 */
  __IO uint32_t SD_B1_IO_CTRL;                     /**< GPIO_SD_B1 bank IO control, offset: 0x148 */
  __IO uint32_t SD_B2_IO_CTRL;                     /**< GPIO_SD_B2 bank IO control, offset: 0x14C */
  __IO uint32_t GPIO_B1_IO_CTRL;                   /**< GPIO_B1 bank IO control, offset: 0x150 */
  __IO uint32_t GPIO_B2_IO_CTRL;                   /**< GPIO_B2 bank IO control, offset: 0x154 */
  __IO uint32_t MISC_IO_CTRL;                      /**< Miscellaneous control register of IO, offset: 0x158 */
} BLK_CTRL_WAKEUPMIX_Type;

/* ----------------------------------------------------------------------------
   -- BLK_CTRL_WAKEUPMIX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BLK_CTRL_WAKEUPMIX_Register_Masks BLK_CTRL_WAKEUPMIX Register Masks
 * @{
 */

/*! @name IPG_DEBUG1 - IPG DEBUG mask bit */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_CAN2_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_CAN2_SHIFT (0U)
/*! M33_CAN2 - CAN2 debug halted mode with M7
 *  0b0..CAN2 does not enter debug halted mode with CM33
 *  0b1..CAN2 enters debug halted mode when CM33 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_CAN2(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_CAN2_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_CAN2_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_EDMA4_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_EDMA4_SHIFT (1U)
/*! M33_EDMA4 - EDMA4 debug halted mode with M33
 *  0b0..EDMA4 does not enter debug halted mode with CM33
 *  0b1..EDMA4 enters debug halted mode when CM33 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_EDMA4(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_EDMA4_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_EDMA4_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO1_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO1_SHIFT (2U)
/*! M33_FLEXIO1 - FLEXIO1 debug halted mode with M33
 *  0b0..FLEXIO1 does not enter debug halted mode with CM33
 *  0b1..FLEXIO1 enters debug halted mode when CM33 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO1(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO1_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO1_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO2_MASK (0x8U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO2_SHIFT (3U)
/*! M33_FLEXIO2 - FLEXIO2 debug halted mode with M33
 *  0b0..FLEXIO2 does not enter debug halted mode with CM33
 *  0b1..FLEXIO2 enters debug halted mode when CM33 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO2(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO2_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_FLEXIO2_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_LPI2C3_MASK (0x10U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_LPI2C3_SHIFT (4U)
/*! M33_LPI2C3 - LPI2C3 debug halted mode with M33
 *  0b0..LPI2C3 does not enter debug halted mode with CM33
 *  0b1..enters debug halted mode when CM33 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_LPI2C3(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_LPI2C3_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG1_M33_LPI2C3_MASK)

