Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER7_MASK (0x2000000U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER7_SHIFT (25U)
/*! M7_QTIMER7 - QTIMER7 debug halted mode with M7
 *  0b0..QTIMER7 does not enter debug halted mode with CM7
 *  0b1..QTIMER7 enters debug halted mode when CM7 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER7(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER7_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER7_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER8_MASK (0x4000000U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER8_SHIFT (26U)
/*! M7_QTIMER8 - QTIMER8 debug halted mode with M7
 *  0b0..QTIMER8 does not enter debug halted mode with CM7
 *  0b1..QTIMER8 enters debug halted mode when CM7 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER8(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER8_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_QTIMER8_MASK)

#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_I3C2_MASK (0x8000000U)
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_I3C2_SHIFT (27U)
/*! M7_I3C2 - debug halted mode with M7
 *  0b0..I3C2 does not enter debug halted mode with CM7
 *  0b1..I3C2 enters debug halted mode when CM7 is debug halted
 */
#define BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_I3C2(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_I3C2_SHIFT)) & BLK_CTRL_WAKEUPMIX_IPG_DEBUG3_M7_I3C2_MASK)
/*! @} */

/*! @name SSI - SSI master low power mode control */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SSI_SSI_IDLE_MASK     (0x1U)
#define BLK_CTRL_WAKEUPMIX_SSI_SSI_IDLE_SHIFT    (0U)
/*! SSI_IDLE - WAKEUP Domain to M7 SSI master idle
 *  0b0..WAKEUP Domain to M7 SSI master is not idle
 *  0b1..WAKEUP Domain to M7 SSI master is idle
 */
#define BLK_CTRL_WAKEUPMIX_SSI_SSI_IDLE(x)       (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SSI_SSI_IDLE_SHIFT)) & BLK_CTRL_WAKEUPMIX_SSI_SSI_IDLE_MASK)

#define BLK_CTRL_WAKEUPMIX_SSI_BLKHOLE_MODE_B_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_SSI_BLKHOLE_MODE_B_SHIFT (1U)
/*! BLKHOLE_MODE_B - WAKEUP Domain to M7 SSI master blackhole mode
 *  0b0..WAKEUP Domain to M7 SSI master will exit blackhole mode
 *  0b1..WAKEUP Domain to M7 SSI master will enter blackhole mode
 */
#define BLK_CTRL_WAKEUPMIX_SSI_BLKHOLE_MODE_B(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SSI_BLKHOLE_MODE_B_SHIFT)) & BLK_CTRL_WAKEUPMIX_SSI_BLKHOLE_MODE_B_MASK)

#define BLK_CTRL_WAKEUPMIX_SSI_PAUSE_MODE_MASK   (0x4U)
#define BLK_CTRL_WAKEUPMIX_SSI_PAUSE_MODE_SHIFT  (2U)
/*! PAUSE_MODE - WAKEUP Domain to M7 SSI master pause mode
 *  0b0..WAKEUP Domain to M7 SSI master will enter pause mode
 *  0b1..WAKEUP Domain to M7 SSI master will exit pause mode
 */
#define BLK_CTRL_WAKEUPMIX_SSI_PAUSE_MODE(x)     (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SSI_PAUSE_MODE_SHIFT)) & BLK_CTRL_WAKEUPMIX_SSI_PAUSE_MODE_MASK)
/*! @} */

/*! @name ECAT_MISC_CFG - EtherCAT miscellaneous configuration */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL0_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL0_SHIFT (0U)
/*! RMII_SEL0 - RMII mode selection for EtherCAT port 0
 *  0b0..EtherCAT port0 is in MII mode
 *  0b1..EtherCAT port0 is in RMII mode
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL0(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL0_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL0_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL1_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL1_SHIFT (1U)
/*! RMII_SEL1 - RMII mode selection for EtherCAT port 1
 *  0b0..EtherCAT port1 is in MII mode
 *  0b1..EtherCAT port1 is in RMII mode
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL1(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL1_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_SEL1_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_EN_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_EN_SHIFT (2U)
/*! GLB_EN - Global enable of EtherCAT
 *  0b0..EtherCAT is off
 *  0b1..EtherCAT is on
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_RST_MASK (0x8U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_RST_SHIFT (3U)
/*! GLB_RST - Global reset of EtherCAT
 *  0b0..EtherCAT is out of reset
 *  0b1..EtherCAT is held in reset
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_RST(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_RST_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_GLB_RST_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR0_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR0_SHIFT (8U)
/*! RMII_REF_CLK_DIR0 - RMII Port0 REF_CLK direction control
 *  0b0..RMII REF_CLK is input
 *  0b1..RMII REF_CLK is output driven by ECAT_CLK_ROOT/2
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR0(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR0_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR0_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR1_MASK (0x200U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR1_SHIFT (9U)
/*! RMII_REF_CLK_DIR1 - RMII Port1 REF_CLK direction control
 *  0b0..RMII REF_CLK is input
 *  0b1..RMII REF_CLK is output driven by ECAT_CLK_ROOT/2
 */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR1(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR1_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_RMII_REF_CLK_DIR1_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_MASK (0x10000U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_SHIFT (16U)
/*! PHY_OFFSET - EtherCAT PHY_OFFSET */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_MASK)

#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_VEC_MASK (0x3E0000U)
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_VEC_SHIFT (17U)
/*! PHY_OFFSET_VEC - EtherCAT PHY_OFFSET_VEC */
#define BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_VEC(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_VEC_SHIFT)) & BLK_CTRL_WAKEUPMIX_ECAT_MISC_CFG_PHY_OFFSET_VEC_MASK)

