Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_CFG_IERB_LOCK_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_CFG_IERB_LOCK_SHIFT (8U)
/*! CFG_IERB_LOCK - Default value for IERB NETCRR[LOCK] bit. Determines write accessibility of IERB registers after power-on-reset
 *  0b0..Unlocked after power-on-reset. Normal read/write access to all IERB registers
 *  0b1..Locked after power-on-reset. Write access inhibited to all IERB registers, except NETCRR
 */
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_CFG_IERB_LOCK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_CFG_IERB_LOCK_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_CFG_IERB_LOCK_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL_MASK (0x1000000U)
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL_SHIFT (24U)
/*! TMR_EXT_CLK_SEL - 1588 timer external clock selection
 *  0b0..CCM tmr_1588_clk_root is selected
 *  0b1..External pin is selected
 */
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG1_SEL_MASK (0x2000000U)
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG1_SEL_SHIFT (25U)
/*! TMR_TRIG1_SEL - 1588 timer trigger1 input selection
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG1_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG1_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG1_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG2_SEL_MASK (0x4000000U)
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG2_SEL_SHIFT (26U)
/*! TMR_TRIG2_SEL - 1588 timer trigger2 input selection
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG2_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG2_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_TRIG2_SEL_MASK)
/*! @} */

/*! @name M7_NMI_CLR - M7 NMI interrupt clear register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_M7_NMI_CLR_M7_NMI_CLEAR_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_M7_NMI_CLR_M7_NMI_CLEAR_SHIFT (0U)
/*! M7_NMI_CLEAR - Clear CM7 NMI holding register */
#define BLK_CTRL_WAKEUPMIX_M7_NMI_CLR_M7_NMI_CLEAR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_M7_NMI_CLR_M7_NMI_CLEAR_SHIFT)) & BLK_CTRL_WAKEUPMIX_M7_NMI_CLR_M7_NMI_CLEAR_MASK)
/*! @} */

/*! @name QTIMER_CTRL1 - Qtimer miscellaneous control register 1 */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR_CNTS_FREEZE_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR_CNTS_FREEZE_SHIFT (0U)
/*! QTIMER1_TMR_CNTS_FREEZE - QTIMER1 timer counter freeze
 *  0b0..Timer counter works normally
 *  0b1..Reset counter and output flags
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR_CNTS_FREEZE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR_CNTS_FREEZE_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR_CNTS_FREEZE_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_SHIFT (1U)
/*! QTIMER1_TMR0_INPUT_SEL - QTIMER1 TMR0 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL_SHIFT (2U)
/*! QTIMER1_TMR1_INPUT_SEL - QTIMER1 TMR1 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR2_INPUT_SEL_MASK (0x8U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR2_INPUT_SEL_SHIFT (3U)
/*! QTIMER1_TMR2_INPUT_SEL - QTIMER1 TMR2 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR2_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR2_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR2_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR3_INPUT_SEL_MASK (0x10U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR3_INPUT_SEL_SHIFT (4U)
/*! QTIMER1_TMR3_INPUT_SEL - QTIMER1 TMR3 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR3_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR3_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR3_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR_CNTS_FREEZE_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR_CNTS_FREEZE_SHIFT (8U)
/*! QTIMER2_TMR_CNTS_FREEZE - QTIMER2 timer counter freeze
 *  0b0..Timer counter works normally
 *  0b1..Reset counter and output flags
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR_CNTS_FREEZE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR_CNTS_FREEZE_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR_CNTS_FREEZE_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR0_INPUT_SEL_MASK (0x200U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR0_INPUT_SEL_SHIFT (9U)
/*! QTIMER2_TMR0_INPUT_SEL - QTIMER2 TMR0 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR0_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR0_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR0_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR1_INPUT_SEL_MASK (0x400U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR1_INPUT_SEL_SHIFT (10U)
/*! QTIMER2_TMR1_INPUT_SEL - QTIMER2 TMR1 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR1_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR1_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER2_TMR1_INPUT_SEL_MASK)

