Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR1_INPUT_SEL_MASK (0x4000000U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR1_INPUT_SEL_SHIFT (26U)
/*! QTIMER8_TMR1_INPUT_SEL - QTIMER8 TMR1 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR1_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR1_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR1_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR2_INPUT_SEL_MASK (0x8000000U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR2_INPUT_SEL_SHIFT (27U)
/*! QTIMER8_TMR2_INPUT_SEL - QTIMER8 TMR2 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR2_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR2_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR2_INPUT_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR3_INPUT_SEL_MASK (0x10000000U)
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR3_INPUT_SEL_SHIFT (28U)
/*! QTIMER8_TMR3_INPUT_SEL - QTIMER8 TMR3 input select
 *  0b0..Input from IOMUX
 *  0b1..Input from XBAR
 */
#define BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR3_INPUT_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR3_INPUT_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_QTIMER_CTRL2_QTIMER8_TMR3_INPUT_SEL_MASK)
/*! @} */

/*! @name SAI2_MCLK_CTRL - SAI2 MCLK control register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK3_SEL_MASK (0x3U)
#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK3_SEL_SHIFT (0U)
/*! SAI2_MCLK3_SEL - SAI2 MCLK3 source select
 *  0b00..SPDIF_CLK_ROOT
 *  0b01..spdif_tx_clk2
 *  0b10..spdif_srclk
 *  0b11..spdif_outclock
 */
#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK3_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK3_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK3_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK_DIR_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK_DIR_SHIFT (8U)
/*! SAI2_MCLK_DIR - SAI2_MCLK IO direction control. IOMUX need select SAI2 MCLK function.
 *  0b0..SAI2_MCLK is input signal
 *  0b1..SAI2_MCLK is output signal
 */
#define BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK_DIR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK_DIR_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI2_MCLK_CTRL_SAI2_MCLK_DIR_MASK)
/*! @} */

/*! @name SAI3_MCLK_CTRL - SAI3 MCLK control register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK3_SEL_MASK (0x3U)
#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK3_SEL_SHIFT (0U)
/*! SAI3_MCLK3_SEL - SAI3 MCLK3 source select
 *  0b00..SPDIF_CLK_ROOT
 *  0b01..spdif_tx_clk2
 *  0b10..spdif_srclk
 *  0b11..spdif_outclock
 */
#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK3_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK3_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK3_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK_DIR_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK_DIR_SHIFT (8U)
/*! SAI3_MCLK_DIR - SAI3_MCLK IO direction control. IOMUX need select SAI3 MCLK function.
 *  0b0..SAI3_MCLK is input signal
 *  0b1..SAI3_MCLK is output signal
 */
#define BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK_DIR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK_DIR_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI3_MCLK_CTRL_SAI3_MCLK_DIR_MASK)
/*! @} */

/*! @name SAI4_MCLK_CTRL - SAI4 MCLK control register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK1_SEL_MASK (0x7U)
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK1_SEL_SHIFT (0U)
/*! SAI4_MCLK1_SEL - SAI4 MCLK1 source select
 *  0b000..SAI4_CLK_ROOT
 *  0b001..SAI2_CLK_ROOT
 *  0b011..SAI3_CLK_ROOT
 *  0b100..SAI4 MCLK IO pin
 *  0b101..SAI2 MCLK IO pin
 *  0b110..SAI3 MCLK IO pin
 *  0b111..Reserved
 */
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK1_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK1_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK1_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK2_SEL_MASK (0x38U)
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK2_SEL_SHIFT (3U)
/*! SAI4_MCLK2_SEL - SAI4 MCLK2 source select
 *  0b000..SAI4_CLK_ROOT
 *  0b001..SAI2_CLK_ROOT
 *  0b011..SAI3_CLK_ROOT
 *  0b100..SAI4 MCLK IO pin
 *  0b101..SAI2 MCLK IO pin
 *  0b110..SAI3 MCLK IO pin
 *  0b111..Reserved
 */
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK2_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK2_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK2_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK3_SEL_MASK (0xC0U)
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK3_SEL_SHIFT (6U)
/*! SAI4_MCLK3_SEL - SAI4 MCLK3 source select
 *  0b00..SPDIF_CLK_ROOT
 *  0b01..spdif_tx_clk2
 *  0b10..spdif_srclk
 *  0b11..spdif_outclock
 */
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK3_SEL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK3_SEL_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK3_SEL_MASK)

#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK_DIR_MASK (0x100U)
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK_DIR_SHIFT (8U)
/*! SAI4_MCLK_DIR - SAI4_MCLK IO direction control. IOMUX need select SAI4 MCLK function. */
#define BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK_DIR(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK_DIR_SHIFT)) & BLK_CTRL_WAKEUPMIX_SAI4_MCLK_CTRL_SAI4_MCLK_DIR_MASK)
/*! @} */

/*! @name XBAR_DIR_CTRL1 - XBAR IO direction control register */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_MASK (0x10U)
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_SHIFT (4U)
/*! IOMUXC_XBAR_DIR_SEL_4 - IOMUXC XBAR_INOUT4 function direction select
 *  0b0..XBAR_INOUT as input
 *  0b1..XBAR_INOUT as output
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_MASK (0x20U)
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_SHIFT (5U)
/*! IOMUXC_XBAR_DIR_SEL_5 - IOMUXC XBAR_INOUT5 function direction select
 *  0b0..XBAR_INOUT as input
 *  0b1..XBAR_INOUT as output
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_MASK)

#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_6_MASK (0x40U)
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_6_SHIFT (6U)
/*! IOMUXC_XBAR_DIR_SEL_6 - IOMUXC XBAR_INOUT6 function direction select
 *  0b0..XBAR_INOUT as input
 *  0b1..XBAR_INOUT as output
 */
#define BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_6(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_6_SHIFT)) & BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_6_MASK)

