Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPEN_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPEN_SHIFT (2U)
/*! GPIO_EMC1_COMPEN - COMPEN and COMPTQ control the operating modes of the compensation cell */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPEN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPEN_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPEN_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_EN_MASK (0x8U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_EN_SHIFT (3U)
/*! GPIO_EMC1_FASTFRZ_EN - Compensation code fast freeze enable */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCP_MASK (0xF0U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCP_SHIFT (4U)
/*! GPIO_EMC1_RASRCP - GPIO_EMC_B1 IO bank's 4-bit PMOS compensation codes from core */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCP_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCP_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCN_MASK (0xF00U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCN_SHIFT (8U)
/*! GPIO_EMC1_RASRCN - GPIO_EMC_B1 IO bank's 4-bit NMOS compensation codes from core */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCN_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_RASRCN_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SELECT_NASRC_MASK (0x1000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SELECT_NASRC_SHIFT (12U)
/*! GPIO_EMC1_SELECT_NASRC - GPIO_EMC1_NASRC selection */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SELECT_NASRC(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SELECT_NASRC_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SELECT_NASRC_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_REFGEN_SLEEP_MASK (0x2000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_REFGEN_SLEEP_SHIFT (13U)
/*! GPIO_EMC1_REFGEN_SLEEP - GPIO_EMC_B1 IO bank reference voltage generator cell sleep enable */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_REFGEN_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_REFGEN_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_REFGEN_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SUPLYDET_LATCH_MASK (0x4000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SUPLYDET_LATCH_SHIFT (14U)
/*! GPIO_EMC1_SUPLYDET_LATCH - GPIO_EMC_B1 IO bank power supply mode latch enable */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SUPLYDET_LATCH(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SUPLYDET_LATCH_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_SUPLYDET_LATCH_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_MASK (0x8000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_SHIFT (15U)
/*! GPIO_EMC1_FASTFRZ - Compensation code fast-freeze */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_FASTFRZ_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPOK_MASK (0x100000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPOK_SHIFT (20U)
/*! GPIO_EMC1_COMPOK - GPIO_EMC_B1 IO bank compensation OK flag */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPOK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPOK_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_COMPOK_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_NASRC_MASK (0x1E00000U)
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_NASRC_SHIFT (21U)
/*! GPIO_EMC1_NASRC - GPIO_EMC_B1 IO bank compensation codes */
#define BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_NASRC(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_NASRC_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B1_IO_CTRL_GPIO_EMC1_NASRC_MASK)
/*! @} */

/*! @name EMC_B2_IO_CTRL - GPIO_EMC_B2 bank IO control */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FREEZE_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FREEZE_SHIFT (0U)
/*! GPIO_EMC2_FREEZE - Compensation code freeze */
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FREEZE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FREEZE_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FREEZE_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPTQ_MASK (0x2U)
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPTQ_SHIFT (1U)
/*! GPIO_EMC2_COMPTQ - COMPEN and COMPTQ control the operating modes of the compensation cell */
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPTQ(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPTQ_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPTQ_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPEN_MASK (0x4U)
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPEN_SHIFT (2U)
/*! GPIO_EMC2_COMPEN - COMPEN and COMPTQ control the operating modes of the compensation cell */
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPEN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPEN_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_COMPEN_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FASTFRZ_EN_MASK (0x8U)
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FASTFRZ_EN_SHIFT (3U)
/*! GPIO_EMC2_FASTFRZ_EN - Compensation code fast freeze enable */
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FASTFRZ_EN(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FASTFRZ_EN_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_FASTFRZ_EN_MASK)

#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_RASRCP_MASK (0xF0U)
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_RASRCP_SHIFT (4U)
/*! GPIO_EMC2_RASRCP - GPIO_EMC_B2 IO bank's 4-bit PMOS compensation codes from core */
#define BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_RASRCP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_RASRCP_SHIFT)) & BLK_CTRL_WAKEUPMIX_EMC_B2_IO_CTRL_GPIO_EMC2_RASRCP_MASK)

