Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_BLK_CTRL_WAKEUPMIX.h
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_SUPLYDET_LATCH_MASK (0x4000U)
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_SUPLYDET_LATCH_SHIFT (14U)
/*! GPIO_B2_SUPLYDET_LATCH - GPIO_B2 IO bank power supply mode latch enable */
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_SUPLYDET_LATCH(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_SUPLYDET_LATCH_SHIFT)) & BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_SUPLYDET_LATCH_MASK)

#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_FASTFRZ_MASK (0x8000U)
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_FASTFRZ_SHIFT (15U)
/*! GPIO_B2_FASTFRZ - Compensation code fast-freeze */
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_FASTFRZ(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_FASTFRZ_SHIFT)) & BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_FASTFRZ_MASK)

#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_COMPOK_MASK (0x100000U)
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_COMPOK_SHIFT (20U)
/*! GPIO_B2_COMPOK - GPIO_B2 IO bank compensation OK flag */
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_COMPOK(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_COMPOK_SHIFT)) & BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_COMPOK_MASK)

#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_NASRC_MASK (0x1E00000U)
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_NASRC_SHIFT (21U)
/*! GPIO_B2_NASRC - GPIO_B2 IO bank compensation codes */
#define BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_NASRC(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_NASRC_SHIFT)) & BLK_CTRL_WAKEUPMIX_GPIO_B2_IO_CTRL_GPIO_B2_NASRC_MASK)
/*! @} */

/*! @name MISC_IO_CTRL - Miscellaneous control register of IO */
/*! @{ */

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_MASK (0x1U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_SHIFT (0U)
/*! I3C_ON_CHIP_STRONG_PULL_DIS - Disable I3C on-chip strong pull for I3C2
 *  0b0..On-chip strong pull is enabled
 *  0b1..On-chip strong pull is disabled
 */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_I3C_ON_CHIP_STRONG_PULL_DIS_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_HIGH_RANGE_MASK (0x10U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_HIGH_RANGE_SHIFT (4U)
/*! GPIO_AD_HIGH_RANGE - GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17 */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_HIGH_RANGE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_HIGH_RANGE_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_HIGH_RANGE_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_LOW_RANGE_MASK (0x20U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_LOW_RANGE_SHIFT (5U)
/*! GPIO_AD_LOW_RANGE - GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17 */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_LOW_RANGE(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_LOW_RANGE_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_GPIO_AD_LOW_RANGE_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC1_SLEEP_MASK (0x400U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC1_SLEEP_SHIFT (10U)
/*! SUPLYDET_EMC1_SLEEP - GPIO_EMC_B1 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC1_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC1_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC1_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC2_SLEEP_MASK (0x800U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC2_SLEEP_SHIFT (11U)
/*! SUPLYDET_EMC2_SLEEP - GPIO_EMC_B2 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC2_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC2_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_EMC2_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD1_SLEEP_MASK (0x1000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD1_SLEEP_SHIFT (12U)
/*! SUPLYDET_SD1_SLEEP - GPIO_SD_B1 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD1_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD1_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD1_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD2_SLEEP_MASK (0x2000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD2_SLEEP_SHIFT (13U)
/*! SUPLYDET_SD2_SLEEP - GPIO_SD_B2 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD2_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD2_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_SD2_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B1_SLEEP_MASK (0x4000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B1_SLEEP_SHIFT (14U)
/*! SUPLYDET_GPIO_B1_SLEEP - GPIO_GPIO_B1 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B1_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B1_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B1_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B2_SLEEP_MASK (0x8000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B2_SLEEP_SHIFT (15U)
/*! SUPLYDET_GPIO_B2_SLEEP - GPIO_GPIO_B1 IO bank supply voltage detector sleep mode enable */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B2_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B2_SLEEP_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_SUPLYDET_GPIO_B2_SLEEP_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT0_POL_MASK (0x10000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT0_POL_SHIFT (16U)
/*! ECAT_LINK_ACT0_POL - ECAT_LINK_ACT[0] polarity control */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT0_POL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT0_POL_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT0_POL_MASK)

#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT1_POL_MASK (0x20000U)
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT1_POL_SHIFT (17U)
/*! ECAT_LINK_ACT1_POL - ECAT_LINK_ACT[1] polarity control */
#define BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT1_POL(x) (((uint32_t)(((uint32_t)(x)) << BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT1_POL_SHIFT)) & BLK_CTRL_WAKEUPMIX_MISC_IO_CTRL_ECAT_LINK_ACT1_POL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group BLK_CTRL_WAKEUPMIX_Register_Masks */


/*!
 * @}
 */ /* end of group BLK_CTRL_WAKEUPMIX_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_BLK_CTRL_WAKEUPMIX_H_ */

